close all;
clc;
clear;


%====Координаты маяков=====%
Kx = [5000; 1000; 9000];
Ky = [6000; 1000; 1000];


%====Разница хода между маяками====%
dt12 = 1.47 * 1e-6;
dt13 = -13.4 * 1e-6;
dt23 = dt13 - dt12;

c = 299792458; % Скорость звука


%====разница расстояний от источника до приёмников=====%
dl12 = dt12  * c;
dl13 = dt13  * c;
dl23 = dt23  * c;


%======Построение гипербол====%
f1 = @(x,y) ((x - Kx(1)).^2 + (y- Ky(1)).^2 ).^(1/2) - ((x- Kx(2)).^2 + (y- Ky(2)).^2 ).^(1/2) - dl12;
f2 = @(x,y) ((x - Kx(1)).^2 + (y- Ky(1)).^2 ).^(1/2) - ((x- Kx(3)).^2 + (y- Ky(3)).^2 ).^(1/2) - dl13;
f3 = @(x,y) ((x - Kx(2)).^2 + (y- Ky(2)).^2 ).^(1/2) - ((x- Kx(3)).^2 + (y- Ky(3)).^2 ).^(1/2) - dl23;



figure("Name", 'Нахождение координаты ИРИ', 'NumberTitle','off')
fimplicit(f1,[0 10000 0 10000], LineWidth=2); grid on;
hold on;
fimplicit(f2,[0 10000 0 10000], LineWidth=2); grid on;
hold on;
fimplicit(f3,[0 10000 0 10000], LineWidth=2); grid on;
xlabel('x');
ylabel('y');



% Найти точку пересечения гипербол
[x, y] = ginput(1);

% Отобразить точку пересечения
plot(x, y, 'ro', 'MarkerSize', 10);
text(x+100, y+100, 'Точка пересечения', 'FontSize', 14);
